#ifndef SKEET_H
#define SKEET_H
#include <Windows.h>
#include <psapi.h>

#if defined(__GNUC__) || defined(__GNUG__)
#define FORCECALL __attribute__((noinline))
#else
#define FORCECALL __declspec(noinline)
#endif

// Only use if you know what you are doing, incorrect usage of raw functions can cause undefined behavior
#ifdef _SDK_PUBLIC_UNSAFE_MEMBERS
#define MEMBERS_PRIVATE public:
#define MEMBERS_PUBLIC
#else
#define MEMBERS_PRIVATE private:
#define MEMBERS_PUBLIC	public:
#endif

#ifdef SDK_RENDERER_IMP
#define TEXT_FLAG_DPI_SCALED		0x0
#define TEXT_FLAG_BOLD				0x1
#define TEXT_FLAG_LARGE				0x2
#define TEXT_FLAG_SMALL				0x4
#define TEXT_FLAG_CENTRED			0x10
#define TEXT_FLAG_RIGHT_ALIGNED		0x80
#define TEXT_FLAG_DEFAULT			0x100

#define TEXTURE_FLAG_AUTO			0x0
#define TEXTURE_FLAG_FILLED			0x1
#define TEXTURE_FLAG_REPEAT			0x2
#endif

namespace SkeetSDK {
// functions signatures
	// Pulbic signatures
	typedef void* (__cdecl* CFn)(void);	//__cdecl ptr return
	typedef void(__thiscall* ThisFn)(void*);
	typedef	void(__thiscall* T2PFn)(void*, void*); // __thiscall 2 pointers
	typedef void(__fastcall* F2PFn)(void*, void*);	//__fascall 2 pointers
	typedef void(__thiscall* ThisIntFn)(void*, int);
	// Memory signatures
	typedef void* (__thiscall* AllocatorFn)(int);
	// Misc signatures
	typedef bool(__fastcall* LoadLuaFn)(wchar_t*, void*);
	typedef unsigned int(__fastcall* HashFn)(const wchar_t*);
	typedef void* (__fastcall* CryptFn)(wchar_t*, size_t, int);

	typedef void* (__thiscall* TBConFn)(void*, void*); // Textbox constructor
	typedef void* (__thiscall* CPConFn)(void*, void*, void*); // ColorPicker constructor
	typedef void* (__thiscall* LConFn)(void*, void*, wchar_t*); // Label constructor
	typedef void* (__thiscall* TCConFn)(void*, void*, wchar_t*, int*); // Tab and Checkbox constructor
	typedef void* (__thiscall* SConFn)(void*, void*, wchar_t*, int, int, int*, bool, unsigned int, float); // Slider constructor
	typedef void* (__thiscall* HKConFn)(void*, void*, void*, bool); // Hotkey constructor
	typedef void* (__thiscall* BConFn)(void*, void*, wchar_t*, int, void*, void*, int); // Button constructor
	typedef void* (__thiscall* CBConFn)(void*, void*, wchar_t*, int*, bool); // Combobox constructor
	typedef void* (__thiscall* MConFn)(void*, void*, wchar_t*, int*, int, bool); // Multiselect constructor
	typedef void* (__thiscall* LBConFn)(void*, void*, wchar_t*, int, int, int*, bool); // Listbox constructor
	typedef void* (__thiscall* CHConFn)(void*, void*, wchar_t*, int, int, bool); // Child constructor
	typedef size_t(__thiscall* GetTBoxTextFn)(void*, wchar_t*);
	// Renderer signatures
	typedef void(__fastcall* RenderFn)(void*, void*);
	typedef void(__cdecl* RenderEventListenerFn)(void);
	typedef void* (__fastcall* ReadFileFn)(void*, const char*);
	typedef bool(__fastcall* LoadTextureFn)(int, const unsigned char*, int, int*, int*, void*);
	typedef int(__fastcall* LoadSvgFormFileFn)(const char*, int, int, int);
	typedef void(__thiscall* RenderIndicatorFn)(int*, void*, const char*, int, unsigned int, int, float);
	typedef bool(__fastcall* WorldToScreenFn)(float*, int*, int*);
	typedef void(__thiscall* RenderBlurFn)(void*, int, int, int, int);
	// Client signatures
	typedef void(__thiscall* LogFn)(char*);
	typedef void(__cdecl* LogErrorFn)(const char*, ...);
	typedef void(__cdecl* LogColorFn)(void*, int*, char*, ...);
	typedef void(__thiscall* ScreenLogFn)(const char*, int);
	typedef void(__fastcall* SetClanTagFn)(const char*, const char*);
// enums
	enum Tab
	{
		Rage,
		AA,
		Legit,
		Visuals,
		Misc,
		Skins,
		Plist,
		Config,
		Lua
	};

	enum MenuStatus
	{
		MenuClosed,
		MenuOpened,
		MenuDragged = 5,
		MenuScaled = 8
	};

	enum FadeType
	{
		FadeNone,
		FadeOut,
		FadeIn
	};

	enum ChildStatus
	{
		ChildIdle,
		ChildDragged,
		ChildResized
	};

	enum MouseStatus
	{
		MouseIdle,
		LClick,
		RClick
	};

	enum PickerStatus
	{
		PickerIdle,
		PickerClicked,
		PickerTint,
		PickerHue,
		PickerAlpha
	};

	enum UiType : unsigned char
	{
		UiNone = 0,
		UiTab,
		UiButton,
		UiCheckbox,
		UiCombobox,
		UiSlider,
		UiListbox,
		UiChild,
		UiLabel,
		UiHotkey,
		UiTextbox,
		UiColorPicker = 12,
		UiMultiselect,
	};

	enum HotkeyMode
	{
		Inherit = -1,
		AlwaysOn,
		OnHotkey,
		Toggle,
		OffHotkey
	};
#ifdef SDK_RENDERER_IMP
	enum TextureType
	{
		TEXTURE_RGBA = -1,
		TEXTURE_SVG,
		TEXTURE_PNG,
		TEXTURE_JPG
	};

	enum RenderEventType
	{
		REVENT_RENDER,
		REVENT_MENU,
		REVENT_FINAL
	};
#endif

//vectors
	struct Vec2f_t
	{
		float x;
		float y;
		Vec2f_t(float x, float y) : x(x), y(y) {};
		Vec2f_t operator-(float min)
		{
			return Vec2f_t(this->x - min, this->y - min);
		};
		void clamp(float min, float max = 3.402823466e+38f)
		{
			if (this->x > max) this->x = max;
			if (this->x < min) this->x = min;
			if (this->y > max) this->y = max;
			if (this->y < min) this->y = min;
		};
	};

	struct Vec3f_t
	{
		float x;
		float y;
		float z;
		Vec3f_t() = default;
		float* array()
		{
			return reinterpret_cast<float*>(this);
		};
	};

	struct Vec2
	{
		int x;
		int y;
		Vec2() : x(0), y(0) {};
		Vec2(int x, int y) : x(x), y(y) {};
		Vec2 operator+(Vec2 vec)
		{
			return Vec2(this->x + vec.x, this->y + vec.y);
		};
		Vec2 operator+(int sum)
		{
			return Vec2(this->x + sum, this->y + sum);
		};
		Vec2 operator-(Vec2 vec)
		{
			return Vec2(this->x - vec.x, this->y - vec.y);
		};
		Vec2 operator-(int sub)
		{
			return Vec2(this->x - sub, this->y - sub);
		};
		Vec2 operator*(float mul)
		{
			return Vec2(this->x * mul, this->y * mul);
		};
		Vec2 operator*(Vec2f_t mul)
		{
			return Vec2((int)((float)this->x * mul.x), (int)((float)this->y * mul.y));
		};
		Vec2& operator+=(const Vec2& vec)
		{
			this->x += vec.x;
			this->y += vec.y;
			return *this;
		}
		int* array()
		{
			return reinterpret_cast<int*>(this);
		};
	};

	class VecCol
	{
	public:
		unsigned char r;
		unsigned char g;
		unsigned char b;
		unsigned char a;
		VecCol(unsigned int hex)
		{
			this->r = (unsigned char)hex;
			this->g = hex >> 8;
			this->b = hex >> 16;
			this->a = hex >> 24;
		}
		VecCol(unsigned char r, unsigned char g, unsigned char b, unsigned char a) : r(r), g(g), b(b), a(a) {};
		int pack()
		{
			return (this->r | this->g << 8 | this->b << 16 | this->a << 24);
		};
		void invert()
		{
			this->r = 255 - this->r;
			this->g = 255 - this->g;
			this->b = 255 - this->b;
			this->a = 255 - this->a;
		};
		VecCol negate()
		{
			return VecCol(255 - this->r, 255 - this->g, 255 - this->b, this->a);
		};
	};

	struct Vec4_8t
	{
		unsigned char x;
		unsigned char y;
		unsigned char z;
		unsigned char w;
		int pack()
		{
			return (this->x | this->y << 8 | this->z << 16 | this->w << 24);
		};
	};

	template<typename T>
	class sVec
	{
		T* buffer;
		T* endbuff;
		size_t length;
	public:
		sVec(size_t size) : length(0)
		{
			this->buffer = (T*)malloc(sizeof(T) * size);
			this->endbuff = this->buffer + size;
		}

		~sVec()
		{
			free(this->buffer);
		};

		void insert(T elem, size_t index)
		{
			size_t csize = size();
			T* newbuff = (T*)malloc(sizeof(T) * csize + 1);
			if (!newbuff) return;
			memcpy(newbuff, this->buffer, index * sizeof(T));
			memcpy(newbuff + index + 1, this->buffer + index, (csize - index) * sizeof(T));
			newbuff[index] = elem;
			free(this->buffer);
			this->buffer = newbuff;
			this->endbuff = this->buffer + ++csize;
			this->length++;
		};

		void push_back(T elem)
		{
			if (this->length >= size())
				resize(size() * 2);
			this->buffer[this->length++] = elem;
		};

		T pop(size_t index = 0)
		{
			if (this->length == 0) return T{ 0 };
			if (index >= this->length) return T{ 0 };
			T elem = this->buffer[index];
			remove(index);
			return elem;
		};

		T pop_back()
		{
			return pop(this->length - 1);
		};

		void fill(T val, size_t size)
		{
			if (size > this->size())
				resize(size);
			memset(this->buffer, val, size * sizeof(T));
		};

		void clear()
		{
			memset(this->buffer, 0, bsize());
			this->length = 0;
		};

		void remove(size_t index)
		{
			memcpy(buffer + index, buffer + index + 1, (this->length-- - index) * sizeof(T));
		};

		void removef(size_t index)
		{
			free(buffer[index]);
			memcpy(buffer + index, buffer + index + 1, (this->length-- - index) * sizeof(T));
		};

		void resize(size_t size)
		{
			T* newbuff = (T*)realloc(this->buffer, size);
			if (!newbuff) return;
			if (this->length >= size)
				this->length = size - 1;
			this->buffer = newbuff;
			this->endbuff = this->buffer + size;
		};

		size_t len()
		{
			return this->length;
		};

		size_t bsize()
		{
			return (uintptr_t)this->endbuff - (uintptr_t)this->buffer;
		};

		size_t size()
		{
			return bsize() / sizeof(T);
		};

		size_t cappacity()
		{
			return (uintptr_t)this->endbuff - (uintptr_t)(this->buffer + this->length);
		};

		T& last()
		{
			return this->buffer[this->length - 1];
		};

		T* begin()
		{
			return this->buffer;
		};

		T* end()
		{
			return this->endbuff;
		};

		T& operator[](size_t i)
		{
			return this->buffer[i];
		};

		void operator<<(T elem)
		{
			push_back(elem);
		};

		void operator<<=(T val)
		{
			last() = val;
		};

		void operator>>(T& out)
		{
			out = pop_back();
		};

		void operator >>=(T& out)
		{
			out = last();
		};

	};

//structs class
#pragma pack(push, 1)
	typedef struct Child* PChild, ** PChilds;
	typedef struct CTab* PCTab, ** PCTabs;
	typedef struct Element* PElement, ** PElements;
	typedef struct CMenu* PCMenu;
	typedef struct Hotkey* PHotkey;
	struct MouseInfo
	{
		MouseStatus Status;
		Vec2		Pos;
		Vec2		LastMenuPos;
	};

	struct Flags
	{
		bool Editable;
		bool Visible;
		bool Hovered;
		bool AllowMouseInput;
		bool SameLine;
	} ;

	typedef struct XorW
	{
		unsigned short	key;
		unsigned short	bsize;
		wchar_t			data[];
	} *PXorW;

	typedef struct Call
	{
		void*	ecx;
		F2PFn	function;	// function(ecx, elementptr)
	} *PCall;

	template <typename T>
	struct BoxVars
	{
		T*		NameChunk;
		T*		NameChunkEnd;
		void*	CpacityEnd;
		char	pad1[0x4];
		int		Index;
	};

	template <typename T>
	struct Header
	{
		char	pad1[0x8];
		int		Index;		// 0xC	in CTab - tab index, in Childs - first element index, in Elements - element index
		T*		Parent;		// 0x10
		Flags	Flags;		// 0x14
		UiType	Type;		// 0x19
		char	pad2[0x2];
		int		Font;		// 0x1C
	};

	// placeholed
	class IElement
	{
		virtual void fn0() = 0;
	};

	// Slider is 0x124 bytes long
	typedef struct Slider : IElement
	{
		Header<Child>		Header;
		Vec2				Pos;			// 0x20
		Vec2				Size;			// 0x28
		char				pad1[0x8];
		PXorW				CryptedName;	// 0x38
		char				pad2[0x4];
		PCall				CallChunk;		// 0x40
		PCall				CallChunkEnd;	// 0x44
		char				pad3[0x8];
		VecCol				Color;			// 0x50
		int					LeftPaddign;	// 0x54
		char				pad4[0x4];
		int*				Value;			// 0x5C
		Vec2				DefSize;		// 0x60
		bool				Active;			// 0x68
		bool				Tooltip;		// 0x69
		char				pad5[0x26];
		int					Max;			// 0x90
		int					Min;			// 0x94
		float				Step;			// 0x98
		int					MaxLen;			// 0x9C
		char				pad6[0x84];
	} *PSlider;

	// Checkbox is 0x78 bytes long
	typedef struct Checkbox : IElement
	{
		Header<Child>		Header;
		Vec2				Pos;			// 0x20
		Vec2				ActivateSize;	// 0x28
		char				pad1[0x8];
		PXorW				CryptedName;	// 0x38
		char				pad2[0x4];
		PCall				CallChunk;		// 0x40
		PCall				CallChunkEnd;	// 0x44
		char				pad3[0x8];
		VecCol				Color;			// 0x50
		int					LeftPaddign;	// 0x54
		char				pad4[0x4];
		int*				Value;			// 0x5C
		Vec2				Size;			// 0x60
		int					TextPadding;	// 0x68
		char				pad5[0xC];
	} *PCheckbox;

	// Multiselect is 0x32C bytes long
	typedef struct Multiselect : IElement
	{
		Header<Child>		Header;
		Vec2				Pos;				// 0x20
		Vec2				Size;				// 0x28
		Vec2				OuterPadding;		// 0x30
		PXorW				CryptedName;		// 0x38
		char				pad1[0x4];
		PCall				CallChunk;			// 0x40
		PCall				CallChunkEnd;		// 0x44
		char				pad2[0x8];
		VecCol				Color;				// 0x50
		int					LeftPaddign;		// 0x54
		char				pad3[0x4];
		int*				Value;				// 0x5C
		int					heigth;				// 0x60
		char				pad4[0x4];
		bool				Popup;				// 0x68
		bool				Clicked;			// 0x69
		bool				NotNull;			// 0x6A
		char				pad5;
		int					HoveredItem;		// 0x6C
		char*				StringValue;		// 0x70
		char*				StringValueEnd;		// 0x74
		void*				StringValueChunkEnd;// 0x78
		char				pad6[0x4];
		BoxVars<char>*		VarsChunk;			// 0x80
		BoxVars<char>*		VarsChunkEnd;		// 0x84
		char				pad7[0x8];
		BoxVars<char>		Vars[];				// 0x90
	} *PMultiselect;

	typedef struct
	{
		wchar_t* data;
		int	len;
	} wchar_str;

	struct wchar_set
	{
		int			Index;
		wchar_t*	NameChunk;
		void*		NameChunkEnd;
		void*		CapacityEnd;
		char		pad2[0x4];
	};

	typedef struct HotkeyPopup : IElement
	{
		Header<Hotkey>		Header;
		Vec4_8t				XAxis;			// 0x20
		Vec4_8t				YAxis;			// 0x24
		Vec2				Size;			// 0x28
		char				pad3[0x20];
		VecCol				Color;			// 0x50
		char				pad4[0x14];
		int					HoveredItem;	// 0x68
		int					SelectedItem;	// 0x6C
		SetModeFn			SetMode;		// 0x70
		wchar_str			Variants[4];	// 0x74
	} HotkeyPop, *PHotkeyPop;

	// HotkeyInfo is 0x28 bytes long
	typedef struct HotkeyInfo
	{
		char			pad1[0x10];
		int				Key;		// 0x10
		HotkeyMode		Mode;		// 0x14
		char			pad[0x10];
	} *PHotkeyInfo;

	// Hotkey is 0x70 bytes long
	struct Hotkey : IElement
	{
		Header<Child>		Header;
		Vec2				Pos;					// 0x20
		Vec2				ActivateSize;			// 0x28
		Vec2				DefaultActivateSize;	// 0x30
		PXorW				CryptedName;			// 0x38
		char				pad1[0x4];
		PCall				CallChunk;				// 0x40
		PCall				CallChunkEnd;			// 0x44
		char				pad2[0x8];
		VecCol				Color;					// 0x50
		int					LeftPaddign;			// 0x54
		char				pad3[0x4];
		PHotkeyInfo			Info;					// 0x5C
		bool				SetingKey;				// 0x60
		char				pad4;
		wchar_t				KeyText[0x4];			// 0x62
		char				pad5[0x2];
		PHotkeyPop			Popup;					// 0x6C
	};

	// Button is 0x64 bytes long
	typedef struct Button : IElement
	{
		Header<Child>		Header;
		Vec2				Pos;				// 0x20
		Vec2				Size;				// 0x28
		Vec2				DefSize;			// 0x30
		PXorW				CryptedName;		// 0x38
		char				pad1[0x4];
		PCall				CallChunk;			// 0x40
		PCall				CallChunkEnd;		// 0x44
		char				pad2[0x8];
		VecCol				Color;				// 0x50
		int					LeftPaddign;		// 0x54
		char				pad3[0xC];
	} *PButton;

	struct ColorPopup
	{
		int		XAxis;			// 0x64
		Vec2	Size;			// 0x68
		Vec2	TintPos;		// 0x70
		Vec2	TintSize;		// 0x78
		Vec2	HuePos;			// 0x80
		Vec2	HueSize;		// 0x88
		Vec2	AlphaPos;		// 0x90
		Vec2	AlphaSize;		// 0x98
	};

	typedef struct
	{
		float	Hue;
		float	Saturation;
		float	Value;
	} HSV, HSB;

	// ColorPicker is 0x138 bytes long
	typedef struct ColorPicker : IElement
	{
		Header<Child>		Header;
		Vec2				Pos;			// 0x20
		Vec2				Size;			// 0x28
		Vec2				DefSize;		// 0x30
		PXorW				CryptedName;	// 0x38
		char				pad1[0x4];
		PCall				CallChunk;		// 0x40
		PCall				CallChunkEnd;	// 0x44
		char				pad2[0x8];
		VecCol				Color;			// 0x50
		int					LeftPaddign;	// 0x54
		char				pad3[0x4];
		VecCol* Value;			// 0x5C
		char				pad4[0x4];
		ColorPopup			Popup;			// 0x64
		char				pad5[0x88];
		PickerStatus		Status;			// 0x128
		HSV					HSV;			// 0x12C
	} CPicker, *PCPicker;

	// Combobox is 0xA8 bytes long
	typedef struct Combobox : IElement
	{
		Header<Child>		Header;
		Vec2				Pos;				// 0x20
		Vec2				InnerPadding;		// 0x28
		Vec2				OuterPadding;		// 0x30
		PXorW				CryptedName;		// 0x38
		char				pad1[0x4];
		PCall				CallChunk;			// 0x40
		PCall				CallChunkEnd;		// 0x44
		char				pad2[0x8];
		VecCol				Color;				// 0x50
		Vec2				BoxPos;				// 0x54
		int*				Value;				// 0x5C
		int					Defheigth;			// 0x60
		int					heigth;				// 0x64
		int					DefInteractOffset;	// 0x68
		int					InteractOffset;		// 0x6C
		bool				Open;				// 0x70
		bool				Clicked;			// 0x71
		char				pad3[0x2];
		int					HoveredItem;		// 0x74
		int					SelectedItem;		// 0x78
		BoxVars<wchar_t>*	VarsChunk;			// 0x7C
		BoxVars<wchar_t>*	VarsChunkEnd;		// 0x80
		char				pad4[0x24];
	} *PCombobox;

	// Label 0x60 bytes long
	typedef struct Label : IElement
	{
		Header<Child>		Header;
		Vec2				Pos;				// 0x20
		Vec2				OuterPadding;		// 0x28
		Vec2				DefOuterPadding;	// 0x30
		PXorW				CryptedName;		// 0x38
		char				pad1[0x4];
		PCall				CallChunk;			// 0x40
		PCall				CallChunkEnd;		// 0x44
		char				pad2[0x8];
		VecCol				Color;				// 0x50
		int					LeftPaddign;		// 0x54
		char				pad3[0x8];
	} *PLabel;

	typedef struct ListboxInfo
	{
		char		pad1[0x4];
		int			SelectedItem;	// 0x88
		char		pad2[0x4];
		wchar_set*  ItemsChunk;		// 0x90
		wchar_set*  ItemsChunkEnd;	// 0x94
		char		pad3[0x8];
	} ListInfo, *PListInfo;

	typedef struct SSpec
	{
		short FindedIndex;
		short Indexies[];
	} *PSpec;

	// Listbox is 0xC0 bytes long
	typedef struct Listbox : IElement
	{
		Header<Child>		Header;
		Vec2				Pos;				// 0x20
		Vec2				Size;				// 0x28
		char				pad1[0x8];
		PXorW				CryptedName;		// 0x38
		char				pad2[0x4];
		PCall				CallChunk;			// 0x40
		PCall				CallChunkEnd;		// 0x44
		char				pad3[0x8];
		VecCol				Color;				// 0x50
		int					LeftPaddign;		// 0x54
		char				pad4[0x8];
		int					ElementSize;		// 0x60
		PListInfo			PInfo;				// 0x64
		char				pad5[0xC];
		size_t				ItemsCount;			// 0x74
		char				pad6[0x4];
		int					SearchPresent;		// 0x7C
		int					DisplayedCount;		// 0x80
		ListboxInfo			Info;				// 0x84
		wchar_t*			SearchChunk;		// 0xA0
		wchar_t*			SearchChunkEnd;		// 0xA4
		void*				SearchCapacityEnd;	// 0xA8
		char				pad7[0x4];
		PSpec				SSpecChunk;			// 0xB0
		short*				SSpecChunkEnd;		// 0xB4
		void*				SSpecCapacityEnd;	// 0xB8
		char				pad8[0x4];
	} *PListbox;

	// Textbox is 0xE8 bytes long
	typedef struct Textbox : IElement
	{
		Header<Child>		Header;
		Vec2				Pos;				// 0x20
		Vec2				Size;				// 0x28
		char				pad1[0x8];
		PXorW				CryptedName;		// 0x38
		char				pad2[0x4];
		PCall				CallChunk;			// 0x40
		PCall				CallChunkEnd;		// 0x44
		char				pad3[0x8];
		VecCol				Color;				// 0x50
		int					LeftPaddign;		// 0x54
		char				pad4[0xC];
		int					Length;				// 0x64
		wchar_t				Text[0x40];			// 0x68
	} *PTextbox;

	typedef struct Inspector
	{
		void**	Vtable;			// 0x00
		char	pad1[0x15];
		UiType	Type;			// 0x19
		char	pad2[0x18];
		PXorW	crypted;		// 0x38
		char	pad3[0x4];
		PCall	CallChunk;		// 0x40
		PCall	CallChunkEnd;	// 0x44
		char	pad4[0x14];
		void*	value;			// 0x5C
	} *PInspector;

	typedef struct CWidg
	{
		char	pad1[0x8];
		bool	Modifiable;	// 0xB0
		bool	Movable;	// 0xB1
		char	pad2[0x2];
		VecCol	NameCol;	// 0xB4
		VecCol	BorderCol;	// 0xB8
		VecCol	ShadowCol;	// 0xBC
		VecCol	BackCol;	// 0xC0
		int		DrawName;	// 0xC4
	} *PCWidg;

	typedef struct Unkn
	{
		void* ptr;
		int i1;
		int i2;
		PXorW name;
	} *PUnkn;

	// Child is 0xC8 bytes long
	struct Child : IElement
	{
		Header<CTab>		Header;
		Vec2				Pos;				// 0x20
		Vec2				Size;				// 0x28
		Vec2				DefSize;			// 0x30
		PXorW				CryptedName;		// 0x38
		PUnkn				Unknown;			// 0x3C
		PCall				CallChunk;			// 0x40
		PCall				CallChunkEnd;		// 0x44
		char				pad1[0x8];
		VecCol				Color;				// 0x50
		char				pad2[0x14];
		Vec2				Padding;			// 0x68
		Vec4_8t				PosSize;			// 0x70 block = minimum size child can be resized/moved by, x = blocks moved by X, y = blocks sized by X, z = blocks moved by Y, w = blocks sized by Y
		Vec2				MouseLastPos;		// 0x74
		ChildStatus			Status;				// 0x7C
		PElements			ElementsChunk;		// 0x80
		PElements			ElementsChunkEnd;	// 0x84
		void*				ElementsCapacityEnd;// 0x88
		char				pad3[0x4];
		PCWidg				PWidgets;			// 0x90
		char				pad4[0x4];
		Vec2				CurSize;			// 0x98
		Vec2				MinimizedCapacity;	// 0xA0
		CWidg				Widgets;			// 0xA8
	};

	struct Element
	{
		template<typename T>
		T* GetAs() { return reinterpret_cast<T*>(this); };
	};

	typedef struct
	{
		char			pad4[0x8];
		int				TextureId;		// 0x80
		int				TextureOffset;	// 0x84
		char			pad5[0x4];
		Vec2			Size;			// 0x8C
	} TabIcon;


	class ITab
	{
	private:
		virtual void fn0() = 0;
		virtual void fn1() = 0;
		virtual void fn2() = 0;
		virtual void fn3() = 0;
		virtual void fn4() = 0;
		virtual void fn5() = 0;
		virtual void fn6() = 0;
		virtual void fn7() = 0;
		virtual void fn8() = 0;
		virtual void fn9() = 0;
		virtual void fn10() = 0;
		virtual void fn11() = 0;
		virtual void fn12() = 0;
		virtual void fn13() = 0;
	public:
		virtual void ResetLayout();
	};
	struct CTab : public ITab
	{
		Header<void>		Header;
		Vec2				Pos;			// 0x20
		Vec2				Size;			// 0x28
		Vec2				DefSize;		// 0x30
		PXorW				CryptedName;	// 0x38
		char				pad1[0x14];
		VecCol				Color;			// 0x50
		char				pad2[0xC];
		PCMenu				Menu;			// 0x60
		char				pad3[0xC];
		PChilds				ChildsChunk;	// 0x70
		PChilds				ChildsChunkEnd;	// 0x74
		TabIcon				Icon;			// 0x78
		int					Padding;		// 0x94
		void*				Chunk;			// 0x98
		void*				ChunkEnd;		// 0x9C
		PElement			CEs[0x20];		// 0xA0	childs and some elems lets say it will be 0x20 size for our allocation purposes
	};

	//0x20 Struct for lua listbox chunk in Config tab
	typedef struct
	{
		char		pad1[0x8];
		int			OnStartup;		// 0x8
		wchar_t*	NameChunk;		// 0xC
		void*		NameChunkEnd;	// 0x10
		char		pad2[0xC];
	} LuaChunk;

	struct CMenu
	{
		void**			Vtable;				// 0x0
		PCMenu			NextMenu;			// 0x4
		char			pad1[0x4];
		Vec2			Pos;				// 0xC
		Vec2			Size;				// 0x14
		Vec2			MinSize;			// 0x1C
		Vec2			TabStartPadding;	// 0x24
		Vec2			TabEndPadding;		// 0x2C
		MenuStatus		MenuStatus;			// 0x34
		MouseInfo		Mouse;				// 0x38
		char			pad2[0x8];
		PCTabs			TabsChunk;			// 0x54
		PCTabs			TabsChunkEnd;		// 0x58
		void*			TabsCapacityEnd;	// 0x5C
		char			pad3[0x4];
		Tab				CurrentTab;			// 0x64
		char			pad4[0x20];
		unsigned int	MenuFadeTickCount;	// 0x88
		FadeType		MenuFadeType;		// 0x8C
		char			pad5[0x4];
		void*			SomeVT;				// 0x94
		int				SomeInt;			// 0x98
		char			pad6[0x14];
		float			MenuAlpha;			// 0xB0
		PCTab			Tabs[9];			// 0xB4
		char			pad7[0x4];
		int				BackgroundTextureId;// 0xDC

	};

	typedef struct CLua
	{
		char	pad1[0x44];
		void*	LuaState;		// 0x44
		char	pad2[0x24];
		int		LoadedCount;	// 0x6C
	} *PCLua, **PCLuas;

#pragma pack(pop)

	class IRenderer
	{
	private:
		virtual void fn0() = 0;
		virtual bool fn1() = 0; // Ready?
		virtual void fn2() = 0; // Renders menu shadows and scrollbars
		virtual void _guard_check_icall_nop3() = 0; // CFG ret 0 function
	public:
		virtual void Rect(int x, int y, int h, int w, int color) = 0;
	private:
		virtual void fn5() = 0;
	public:
		virtual void GradientV(int x, int y, int h, int w, int color1, int color2) = 0;
		virtual void GradientH(int x, int y, int h, int w, int color1, int color2) = 0;
		virtual void Line(int x1, int y1, int x2, int y2, int color) = 0;
	private:
		virtual void fn9() = 0;
	public:
		virtual void Triangle(int x1, int y1, int x2, int y2, int x3, int y3, int color) = 0;
		virtual void __vectorcall Circle(int x, int y, int color, float rad, float rot, float percent) = 0;
		virtual void __vectorcall CircleOut(int x, int y, int color, float rad, float rot, float percent, float thick) = 0;
	private:
		//struct point { float x1; float y1; int color1; float x2; float y2; int color2; };
		virtual void __fastcall PolyCircle(void* points, size_t count) = 0;
		virtual void fn14() = 0;
	public:
		virtual void __fastcall Text(int flags, int x, int y, int color, size_t maxlen, wchar_t* text, size_t len) = 0;
	private:
		virtual void fn16() = 0;
	public:
		virtual void __fastcall MeasureText(int* out, wchar_t* text, size_t len, int flags) = 0;
		virtual void __fastcall ScreenSize(int* w, int* h) = 0;
		virtual int __fastcall AddTexture(unsigned char* data, int w, int h, size_t bytesize, int i0, int i1) = 0;
	private:
		virtual void fn20() = 0;
		virtual void fn21() = 0;
		virtual void _guard_check_icall_nop22() = 0; // CFG ret 0 function;
	public:
		virtual void __vectorcall Texture(int id, int x, int y, int color, int offset, int i0, int w, int h, int flag, float scale) = 0;
		virtual void __fastcall SetBounds(int bounds[4]) = 0;
		virtual void __fastcall GetBounds(int bounds[4]) = 0;
		virtual void __fastcall ResetBounds(bool reset) = 0;
		virtual bool IsBoundsPresent() = 0;	// returns true if ResetBounds was called
		virtual void __vectorcall SetAlpha(float alpha) = 0;
		virtual void __vectorcall SetZBuff(float z) = 0; // [0.0, 1.0] 0.0 = topmost, 1.0 = doesnt render
		virtual float GetZBuff() = 0; // [0.0, 1.0] 0.0 = topmost, 1.0 = doesnt render
	private:
		virtual void Monochrome(bool state) = 0; // grey if enemy alive?
		virtual void fn32() = 0;
		virtual float __vectorcall GetScale() = 0; // returns render scale aka dpi
		virtual int __fastcall fn34(int i) = 0; // returns render padding?
		virtual void fn35() = 0;
		virtual void fn36() = 0;
		virtual void fn37() = 0;
		virtual void fn38() = 0;
		virtual float __vectorcall fn39() = 0;
		virtual void __fastcall fn40(int, int*, int*) = 0;
	public:
		virtual void __fastcall RectOut(int thick, int x, int y, int w, int h, int color) = 0;
		virtual void __fastcall RectOutlined(int thick, int x, int y, int w, int h, int colorin, int colorout) = 0;
	};
	struct SkeetClass_
	{
		IRenderer* IRenderer;
		void* DefSubclassProc;
		void* RemoveWindowSubclass;
		void* SetWindowSubclass;
		PCMenu Menu;
		void* ThreadInMainThread;
	};

	typedef struct {
		unsigned char* ChunkStart;
		unsigned char* ChunkEnd;
		unsigned char* CappacityEnd;
	} DataChunk;

	namespace Memory {
		class SigFinder
		{
			MODULEINFO info;
			static sVec<int> ida_sig_resolver(const char* sig);
		public:
			SigFinder(const char* module);
			SigFinder(LPVOID lpBaseAdress, DWORD SizeOfImage);
			FORCECALL void* find(const char* sig, int offset = 0);
			FORCECALL void* findr32(const char* sig);
		};

		class CHooked
		{
			bool Status;
			void* Address;
			unsigned char* OriginalBytes;
			size_t BytesSize;
			void* naked;
		public:
			CHooked(void* func, unsigned char* ogbytes, size_t size);
			~CHooked();
			void* Naked();
			void Unhook();
		};

		class DetourHook
		{
			static sVec<CHooked*> Hooked;
		public:
			static CHooked* Hook(void* Dst, void* Src, size_t size = 5);
			static void UnhookAll();
		};
		static SigFinder	CheatChunk((LPVOID)0x43310000, 0x2FC000u);
		static AllocatorFn	Allocator = (AllocatorFn)CheatChunk.find("56 8B F1 33 C0 85");
	} // namespace Memory

//SDK Vars
	static SkeetClass_* SCLASS = *(SkeetClass_**)Memory::CheatChunk.find("A1 ?? ?? ?? ?? 83 64 24 04 00 89 54 24 18 89 44 24 10 53 56", 0x1);
	static PCMenu Menu = SCLASS->Menu;
//SDK Classes
	class Utils final
	{
		friend class UI;
	MEMBERS_PRIVATE
		static GetConfigDataFn	GetConfigData;
		static LoadConfigFn		LoadConfig;
		static CFn				InitState;
		static CFn				GetState;
		static PCLuas			LuaInfo;
		static LoadLuaFn		LoadLua;
		static DecryptFn		Decrypt;
		static CryptFn			Crypt;
		static ThisFn			InitTab;
		static ThisFn			Callback;
		static HashFn			Hash;
	MEMBERS_PUBLIC
		static unsigned int* HashedCfgName;

		static int			LuaCount();
		static wchar_t*		LuaName(int index);
		static bool			LoadScript(int index);
		static bool			LoadScript(wchar_t* name);
		static void			AllowUnsafe(int value);
		static void			LoadCfg(int index = -1);
		static void			LoadCfg(const char* cfgname);
		static PXorW		CryptName(wchar_t* name);
		static void*		LuaState();
		static void*		GetLuaState();
		static void			ForEach(PChild child, void(*func)(PElement), UiType T = UiNone);
		static PCLua		GetLuaInfo();
		static void			InitConfig();
		static unsigned int ChildsCount(PCTab tab);
		static unsigned int ElementsCount(PChild child);
		static FORCECALL const wchar_t* CurrentConfig();
		static FORCECALL int			CurrentConfigIndex();
	};

	class UI final
	{
	MEMBERS_PRIVATE
		static ThisIntFn		TabSwitch;
		static ThisIntFn		SetList;
		static ThisFn			ChildLayout;
		static ThisFn			KeyInit;
		static SetKeyFn			SetKey;
		static SetCheckFn		SetCheck;
		static HideUiFn			HideUi;
		static F2PFn			DeleteUi;
		static T2PFn			InsertTab;
		static T2PFn			InsertChildr;
		static InsertFn			InsertElem;
		static AddLabelFn		AddLabel;
		static AddButtonFn		AddButton;
		static LConFn			LabelCon;
		static BConFn			ButtonCon;
		static TBConFn			TextboxCon;
		static TCConFn			CheckboxCon;
		static SConFn			SliderCon;
		static HKConFn			HotkeyCon;
		static CPConFn			CPickerCon;
		static CBConFn			ComboboxCon;
		static MConFn			MultiCon;
		static LBConFn			ListboxCon;
		static CHConFn			ChildCon;
		static TCConFn			TabCon;
		static GetTBoxTextFn	GetTBoxText;
	MEMBERS_PUBLIC
		static void			ResetLayout();
		static void			SetTab(Tab tab);
		static PCTab		GetTab(Tab tab);
		static Tab			GetActiveTab();
		static PCTab		GetActiveCTab();
		static void			SetVisible(PElement element, bool value);
		static VecCol		GetMenuCol();
		static void			SetInput(PElement elemen, bool val);
		static void*		TieValue(PElement element, void* ptr);
		static size_t		GetCallbacksCount(PElement elem);
		static void			SetCallback(PElement elem, F2PFn func, void* ecx = NULL);
		static void			DeleteElement(PElement element);
		static void			SetCheckbox(PCheckbox checkbox, int value);
		static void			SetColorRGBA(PCPicker picker, VecCol Color);
		static void			SetColorHSV(PCPicker picker, HSV Color);
		static void			SetSlider(PSlider slider, int value);
		static void			SetCombobox(PCombobox combobox, int value);
		static void			SetListbox(PListbox listbox, int value);
		static void			SetHotkey(PHotkey hotkey, int key, HotkeyMode mode = Inherit);
		static int			ExtractKey(PHotkey hotkey);
		static int			HotkeyState(PHotkey hotkey);
		static void			RenameElement(PElement element, wchar_t* name, PXorW oldname);
		static wchar_t*		GetName(PElement element);
		static size_t		GetTextbotText(PTextbox tbox, wchar_t* buffer);
		static void			InsertElement(PChild child, void* element);
		static PLabel		CreateLabel(PChild child, wchar_t* name);
		static PTextbox		CreateTextbox(PChild child, bool sameline = true, wchar_t* name = NULL);
		static PCheckbox	CreateCheckbox(PChild child, wchar_t* name, int* value);
		static PSlider		CreateSlider(PChild child, wchar_t* name, int min, int max, int* value, bool tooltip = true, wchar_t* tip = NULL, float step = 1.f);
		static PHotkey		CreateHotkey(PChild child, wchar_t* name, bool sameline = false, int vkey = 0x00, HotkeyMode mode = OnHotkey);
		static PButton		CreateButton(PChild child, wchar_t* name, F2PFn function, void* ecx = Menu);
		static PCPicker		CreateColorPicker(PChild child, VecCol* value, bool sameline = true, wchar_t* name = NULL);
		static PCombobox	CreateCombobox(PChild child, wchar_t* name, int* value, wchar_t** arr, size_t arrsize, bool sameline = false);
		static PMultiselect CreateMultiselect(PChild child, wchar_t* name, int* value, char** arr, size_t arrsize, bool sameline = false);
		static PListbox		CreateListbox(PChild child, wchar_t* name, int* value, wchar_t** arr, size_t arrsize, bool searchbox = true);
		static void			AddListboxVar(PListbox list, wchar_t* elem, size_t bsize = 0);
		static void			RemoveListboxVar(PListbox list, size_t index);
		static void			InsertChild(PCTab tab, void* child);
		static PChild		CreateChild(PCTab tab, wchar_t* name, Vec4_8t possize, bool modify);
		static PCTab		CreateTab(wchar_t* name, Vec2 pos);

		static FORCECALL PElement		GetByName(PChild child, const wchar_t* name);
		static FORCECALL PChild			GetChild(Tab tab, size_t index);
		template<typename T> static T*	GetElement(PChild, size_t index);
	};

	class EventListener
	{
		size_t index;
		RenderEventType type;
		bool status;
	public:
		EventListener(size_t index, RenderEventType type) : index(index), type(type), status(true) {};
		~EventListener() { remove(); };
		void remove();
	};

	struct CTexture
	{
		int id;
		TextureType type;
		Vec2 Size;
		CTexture(int id, TextureType type, int width, int heigth) : id(id), type(type), Size(width, heigth) {};
	};

	class Renderer final
	{
	MEMBERS_PRIVATE
		static sVec<RenderEventListenerFn> RenderEvents;
		static sVec<RenderEventListenerFn> MenuEvents;
		static sVec<RenderEventListenerFn> FinalEvents;
		static Memory::CHooked* RenderHook;
		static Memory::CHooked* MenuRenderHook;
		static Memory::CHooked* FinalRenderHook;
		static ReadFileFn ExReadFile;
		static LoadTextureFn LoadTexture;
		static LoadSvgFormFileFn LoadSvgFromFile;
		static RenderIndicatorFn RenderIndicator;
		static WorldToScreenFn WorldToScreen;
		static RenderBlurFn RenderBlur;
		static void* RenderBlurCtx;
		static void __fastcall RenderListener(void* ecx, void* edx);
		static void __fastcall MenuRenderListener(void* ecx, void* edx);
		static void __fastcall RenderFinalListener(void* ecx, void* edx);
		static void RemoveEvent(size_t index, RenderEventType type);
		friend class EventListener;
	MEMBERS_PUBLIC
		static void Init();
		static void Term();
		static EventListener* AddEvent(RenderEventType type, RenderEventListenerFn event);
		static Vec2 ScreenSize();
		static int ScreenWidth();
		static int ScreenHeigth();
		static Vec2 MeasureText(wchar_t* text, unsigned int flags);
		static void ToScreen(Vec3f_t pos, int* x, int* y);
		static void Text(Vec2 pos, VecCol color, wchar_t* text, int flags, unsigned int maxlen = 0);
		static void Line(Vec2 p1, Vec2 p2, VecCol color);
		static void Rect(Vec2 pos, Vec2 size, VecCol color);
		static void RectOut(Vec2 pos, Vec2 size, VecCol color, int thickness);
		static void OutlinedRect(Vec2 pos, Vec2 size, VecCol colorin, VecCol colorout, int thickness);
		static void Gradient(Vec2 pos, Vec2 size, VecCol color1, VecCol color2, bool horizontal = true);
		static void Blur(Vec2 pos, Vec2 size);
		static void Triangle(Vec2 p1, Vec2 p2, Vec2 p3, VecCol color);
		static void Indicator(int y, VecCol color, const char* text, int texureid = -1, float circlepercent = -1.f);
		static void __vectorcall Circle(Vec2 pos, VecCol color, float radius, float rotation = 0.f, float percentage = 1.f);
		static void __vectorcall CircleOut(Vec2 pos, VecCol color, float radius, float rotation = 0.f, float percentage = 1.f, float thickness = 1.f);
		static void Texture(int id, Vec2 pos, Vec2 size, VecCol color, int flag, int offset = 0, float scale = 1.f);
		static CTexture* LoadSVGTextureFromFile(const char* filename, int width = 0, int heigth = 0);
		static FORCECALL CTexture* LoadPNGTextureFromFile(const char* filename, int width = 0, int heigth = 0);
		static FORCECALL CTexture* LoadJPGTextureFromFile(const char* filename, int width = 0, int heigth = 0);
		static FORCECALL CTexture* LoadTextureFromMemory(const unsigned char* data, size_t size, TextureType type, int width, int heigth);
	};

#if defined(SDK_GLOBALS_IMP) || defined(SDK_CLIENT_IMP)
	struct CommandsInfo
	{
		unsigned int	LastOutCommand;	// 0x0
		unsigned int	ChokedCommands;	// 0x4
		unsigned int	OldCommandAck;	// 0x8
		char			pad1[0x4];
		unsigned int	CommandAck;		// 0x10
	};

	class CEngine final
	{
		friend class Globals;
		friend class Client;
		static void**** EngineCtx;
		static CommandsInfo** CommandsCtx;
		static SetClanTagFn SetTag;
		static unsigned int* PredComm;
		static bool IsInGame();
		static char* MapName();
		static void ExecCommand(const char* command);
		static void SetClanTag(const char* tag);
	};
#endif
	struct GlobalsInfo
	{
		float			RealTime;		// 0x0
		int				FrameCount;		// 0x4
		float			AbsFrameTime;	// 0x8
		char			pad1[0x4];
		float			CurrentTime;	// 0x10
		float			FrameTime;		// 0x14
		int				MaxPlayers;		// 0x18
		unsigned int	TickCount;		// 0x1ะก
		float			TickInterval;	// 0x20
	};

	class Globals final
	{
	MEMBERS_PRIVATE
		static GlobalsInfo** GlobalsCtx;
	MEMBERS_PUBLIC
		static bool			IsInGame();
		static char*		MapName();
		static float		RealTime();
		static float		FrameTime(bool abs = false);
		static int			FrameCount();
		static float		CurrentTime();
		static float		TickInterval();
		static unsigned int	TickCount();
		static int			MaxPlayers();
		static unsigned int	LastOutCommand();
		static unsigned int	ChokedCommands();
		static unsigned int	OldCommandAck();
		static unsigned int	CommandAck();
	};

	class Client final
	{
	MEMBERS_PRIVATE
		static LogFn Logger;
		static LogErrorFn LoggerError;
		static void*** LoggerCtx;
		static ScreenLogFn ScreenLogger;
	MEMBERS_PUBLIC
		static void Exec(const char* cmd);
		static void SetClanTag(const char* tag);
		static void LogScreen(const char* text, VecCol color);
		static FORCECALL void Log(const char* fmt, ...);
